In [1]:
import pandas as pd
import numpy as np

In [13]:
names = ["UnitNo", "Time", 'Setting1', 'Setting2', 'Setting3', 'Sensor1', 'Sensor2', 'Sensor3', 'Sensor4', 
         'Sensor5', 'Sensor6', 'Sensor7', 'Sensor8', 'Sensor9', 'Sensor10', 'Sensor11', 'Sensor12', 'Sensor13', 
         'Sensor14', 'Sensor15', 'Sensor16', 'Sensor17', 'Sensor18', 'Sensor19', 'Sensor20', 
         'Sensor21', 'Sensor22', 'Sensor23', 'Sensor24', 'Sensor25', 'Sensor26']

In [18]:
train1 = pd.read_csv("Data/CMAPSSData/train1.csv", sep=' ' ,names=names)
train2 = pd.read_csv("Data/CMAPSSData/train2.csv", sep=' ' ,names=names)
train3 = pd.read_csv("Data/CMAPSSData/train3.csv", sep=' ' ,names=names)
train4 = pd.read_csv("Data/CMAPSSData/train4.csv", sep=' ' ,names=names)
test1 = pd.read_csv("Data/CMAPSSData/test1.csv", sep=' ' ,names=names)
test2 = pd.read_csv("Data/CMAPSSData/test2.csv", sep=' ' ,names=names)
test3 = pd.read_csv("Data/CMAPSSData/test3.csv", sep=' ' ,names=names)
test4 = pd.read_csv("Data/CMAPSSData/test4.csv", sep=' ' ,names=names)

In [27]:
rul1 = pd.read_csv("Data/CMAPSSData/RUL1.csv", names=['RUL'])
rul2 = pd.read_csv("Data/CMAPSSData/RUL2.csv", names=['RUL'])
rul3 = pd.read_csv("Data/CMAPSSData/RUL3.csv", names=['RUL'])
rul4 = pd.read_csv("Data/CMAPSSData/RUL4.csv", names=['RUL'])

In [19]:
train1.head()

,UnitNo,Time,Setting1,Setting2,Setting3,Sensor1,Sensor2,Sensor3,Sensor4,Sensor5,...,Sensor17,Sensor18,Sensor19,Sensor20,Sensor21,Sensor22,Sensor23,Sensor24,Sensor25,Sensor26
0,1,1,-0.0007,-0.0004,100.0,518.67,641.82,1589.70,1400.60,14.62,...,392,2388,100.0,39.06,23.4190,NaN,NaN,NaN,NaN,NaN
1,1,2,0.0019,-0.0003,100.0,518.67,642.15,1591.82,1403.14,14.62,...,392,2388,100.0,39.00,23.4236,NaN,NaN,NaN,NaN,NaN
2,1,3,-0.0043,0.0003,100.0,518.67,642.35,1587.99,1404.20,14.62,...,390,2388,100.0,38.95,23.3442,NaN,NaN,NaN,NaN,NaN
3,1,4,0.0007,0.0000,100.0,518.67,642.35,1582.79,1401.87,14.62,...,392,2388,100.0,38.88,23.3739,NaN,NaN,NaN,NaN,NaN
4,1,5,-0.0019,-0.0002,100.0,518.67,642.37,1582.85,1406.22,14.62,...,393,2388,100.0,38.90,23.4044,NaN,NaN,NaN,NaN,NaN

In [33]:
rul1.head()

   RUL
0  112
1   98
2   69
3   82
4   91

In [31]:
print(train1.shape)
print(rul1.shape)
print(train2.shape)
print(rul2.shape)
print(train3.shape)
print(rul3.shape)
print(train4.shape)
print(rul4.shape)

(20631, 31)
(100, 1)
(53759, 31)
(259, 1)
(24720, 31)
(100, 1)
(61249, 31)
(248, 1)

In [32]:
test1.shape

(13096, 31)